{"config": [{"config": {"input_dtype": "int32", "W_regularizer": null, "input_dim": 40000, "W_constraint": null, "batch_input_shape": [null, 600], "activity_regularizer": null, "name": "embedding_1", "dropout": 0.2, "init": "uniform", "trainable": true, "mask_zero": false, "input_length": 600, "output_dim": 128}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}], "class_name": "Sequential", "keras_version": "1.1.0"}