{"keras_version": "1.1.0", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 128, "activity_regularizer": null, "input_dtype": "int32", "init": "uniform", "dropout": 0.2, "batch_input_shape": [null, 600], "W_constraint": null, "input_length": 600, "name": "embedding_6", "input_dim": 40000, "trainable": true, "mask_zero": false, "W_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true}}]}