{"keras_version": "1.1.0", "config": [{"config": {"batch_input_shape": [null, 600], "input_dtype": "int32", "mask_zero": false, "init": "uniform", "trainable": true, "dropout": 0.2, "input_length": 600, "output_dim": 128, "W_constraint": null, "activity_regularizer": null, "input_dim": 40000, "W_regularizer": null, "name": "embedding_1"}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}], "class_name": "Sequential"}