{"config": [{"config": {"output_shape_type": "raw", "mode_type": "raw", "output_shape": null, "name": "merge_1", "dot_axes": -1, "mode": "concat", "layers": [{"config": [{"config": {"input_dtype": "float32", "W_regularizer": null, "input_dim": 2814, "bias": true, "W_constraint": {"m": 2, "name": "MaxNorm", "axis": 0}, "batch_input_shape": [null, 2814], "activity_regularizer": null, "b_constraint": null, "activation": "relu", "name": "dense_4", "init": "normal", "trainable": true, "b_regularizer": null, "output_dim": 32}, "class_name": "Dense"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dtype": "int32", "W_regularizer": null, "input_dim": 40000, "W_constraint": null, "batch_input_shape": [null, 600], "activity_regularizer": null, "name": "embedding_1", "dropout": 0.2, "init": "uniform", "trainable": true, "mask_zero": false, "input_length": 600, "output_dim": 128}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}], "class_name": "Sequential"}], "concat_axis": 1}, "class_name": "Merge"}, {"config": {"W_regularizer": null, "input_dim": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "name": "dense_5", "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "output_dim": 3}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_4"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.0"}