{"keras_version": "1.1.0", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "mode": "concat", "output_shape_type": "raw", "mode_type": "raw", "dot_axes": -1, "output_shape": null, "concat_axis": 1, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"activation": "relu", "input_dtype": "float32", "init": "normal", "batch_input_shape": [null, 2814], "activity_regularizer": null, "bias": true, "name": "dense_14", "b_regularizer": null, "input_dim": 2814, "b_constraint": null, "trainable": true, "output_dim": 32, "W_constraint": {"axis": 0, "name": "MaxNorm", "m": 2}, "W_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "input_dtype": "int32", "init": "uniform", "dropout": 0.2, "batch_input_shape": [null, 600], "mask_zero": false, "W_constraint": null, "input_length": 600, "name": "embedding_6", "input_dim": 40000, "trainable": true, "output_dim": 128, "W_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true}}]}]}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "name": "dense_15", "b_regularizer": null, "b_constraint": null, "trainable": true, "output_dim": 3, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_13", "activation": "softmax", "trainable": true}}]}