{"keras_version": "1.1.0", "config": [{"config": {"output_shape": null, "mode": "concat", "mode_type": "raw", "concat_axis": 1, "name": "merge_1", "layers": [{"config": [{"config": {"b_regularizer": null, "batch_input_shape": [null, 2858], "input_dtype": "float32", "bias": true, "activity_regularizer": null, "init": "normal", "trainable": true, "output_dim": 32, "input_dim": 2858, "b_constraint": null, "W_constraint": {"m": 2, "axis": 0, "name": "MaxNorm"}, "activation": "relu", "W_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}], "class_name": "Sequential"}, {"config": [{"config": {"batch_input_shape": [null, 600], "input_dtype": "int32", "mask_zero": false, "init": "uniform", "trainable": true, "dropout": 0.2, "input_length": 600, "output_dim": 128, "W_constraint": null, "activity_regularizer": null, "input_dim": 40000, "W_regularizer": null, "name": "embedding_1"}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}], "class_name": "Sequential"}], "output_shape_type": "raw", "dot_axes": -1}, "class_name": "Merge"}, {"config": {"b_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "W_constraint": null, "output_dim": 1, "input_dim": null, "W_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential"}