{"config": [{"config": {"activity_regularizer": null, "W_constraint": {"name": "MaxNorm", "m": 2, "axis": 0}, "input_dtype": "float32", "name": "dense_40", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "output_dim": 32, "activation": "relu", "trainable": true, "batch_input_shape": [null, 5664], "init": "normal", "input_dim": 5664, "bias": true}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "name": "dense_41", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "output_dim": 1, "activation": "linear", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "input_dim": null, "bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_20", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}], "keras_version": "1.1.0", "class_name": "Sequential"}