{"config": [{"config": {"mode": "concat", "output_shape": null, "name": "merge_9", "output_shape_type": "raw", "concat_axis": 1, "layers": [{"config": [{"config": {"activity_regularizer": null, "W_regularizer": null, "init": "normal", "batch_input_shape": [null, 2], "activation": "relu", "b_constraint": null, "name": "dense_22", "input_dtype": "float32", "bias": true, "input_dim": 2, "W_constraint": {"name": "MaxNorm", "axis": 0, "m": 2}, "b_regularizer": null, "trainable": true, "output_dim": 12}, "class_name": "Dense"}], "class_name": "Sequential"}, {"config": [{"config": {"activity_regularizer": null, "W_regularizer": null, "init": "uniform", "dropout": 0.2, "mask_zero": false, "name": "embedding_9", "batch_input_shape": [null, 200], "input_dtype": "int32", "input_length": 200, "input_dim": 20000, "W_constraint": null, "trainable": true, "output_dim": 128}, "class_name": "Embedding"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "init": "uniform", "W_constraint": null, "activation": "relu", "b_constraint": null, "name": "convolution1d_9", "subsample_length": 1, "border_mode": "same", "bias": true, "input_dim": null, "filter_length": 3, "nb_filter": 32, "b_regularizer": null, "trainable": true, "input_length": null}, "class_name": "Convolution1D"}, {"config": {"name": "maxpooling1d_9", "pool_length": 2, "border_mode": "valid", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "return_sequences": false, "dropout_W": 0.2, "activation": "tanh", "name": "lstm_9", "go_backwards": false, "dropout_U": 0.2, "unroll": false, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal", "forget_bias_init": "one", "U_regularizer": null, "consume_less": "cpu", "input_dim": 32, "output_dim": 128, "input_length": null, "b_regularizer": null, "trainable": true, "stateful": false}, "class_name": "LSTM"}], "class_name": "Sequential"}], "dot_axes": -1, "mode_type": "raw"}, "class_name": "Merge"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "bias": true, "output_dim": 32, "input_dim": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "name": "dense_23"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "bias": true, "output_dim": 1, "input_dim": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "name": "dense_24"}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "activation_9", "trainable": true}, "class_name": "Activation"}], "keras_version": "1.1.0", "class_name": "Sequential"}