{"config": [{"config": {"layers": [{"config": [{"config": {"input_dtype": "float32", "activation": "relu", "name": "dense_5", "b_regularizer": null, "b_constraint": null, "output_dim": 12, "activity_regularizer": null, "batch_input_shape": [null, 2], "W_regularizer": null, "input_dim": 2, "init": "normal", "bias": true, "W_constraint": {"m": 2, "axis": 0, "name": "MaxNorm"}, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dtype": "int32", "name": "embedding_1", "output_dim": 128, "mask_zero": false, "activity_regularizer": null, "batch_input_shape": [null, 200], "W_regularizer": null, "input_length": 200, "input_dim": 20000, "init": "uniform", "W_constraint": null, "trainable": true, "dropout": 0.2}, "class_name": "Embedding"}, {"config": {"nb_filter": 32, "activation": "relu", "name": "convolution1d_1", "b_regularizer": null, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "W_regularizer": null, "input_length": null, "input_dim": null, "init": "uniform", "bias": true, "W_constraint": null, "subsample_length": 1, "filter_length": 3, "trainable": true}, "class_name": "Convolution1D"}, {"config": {"pool_length": 2, "border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_1"}, "class_name": "MaxPooling1D"}, {"config": {"forget_bias_init": "one", "consume_less": "cpu", "activation": "tanh", "name": "lstm_1", "stateful": false, "output_dim": 128, "W_regularizer": null, "inner_activation": "hard_sigmoid", "input_length": null, "inner_init": "orthogonal", "input_dim": 32, "go_backwards": false, "U_regularizer": null, "init": "glorot_uniform", "dropout_U": 0.2, "return_sequences": false, "b_regularizer": null, "trainable": true, "unroll": false, "dropout_W": 0.2}, "class_name": "LSTM"}], "class_name": "Sequential"}], "output_shape_type": "raw", "name": "merge_1", "mode_type": "raw", "dot_axes": -1, "concat_axis": 1, "output_shape": null, "mode": "concat"}, "class_name": "Merge"}, {"config": {"activation": "linear", "name": "dense_6", "b_regularizer": null, "trainable": true, "output_dim": 32, "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "dense_7", "b_regularizer": null, "trainable": true, "output_dim": 1, "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "1.1.0", "class_name": "Sequential"}